ab/ab_pux_ext.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking remote.dev (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        remote.dev
Server Port:            80

Document Path:          /pux/eg/hello.php
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   0.179 seconds
Complete requests:      3000
Failed requests:        0
Write errors:           0
Total transferred:      630000 bytes
HTML transferred:       0 bytes
Requests per second:    16777.12 [#/sec] (mean)
Time per request:       2.980 [ms] (mean)
Time per request:       0.060 [ms] (mean, across all concurrent requests)
Transfer rate:          3440.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     1    3   0.3      3       4
Waiting:        1    3   0.3      2       4
Total:          2    3   0.4      3       5
ERROR: The median and mean for the waiting time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      4
  98%      4
  99%      4
 100%      5 (longest request)